// Lab_03_1.cpp
// < Величко Іван Олександрович >
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 0.4

#include <iostream>
#include <cmath>

using namespace std;

int main()
{
	double x; // вхідний параметр
	double y; // результат обчислення виразу
	double A; // проміжний результат - функціонально стала частина виразу
	double B; // проміжний результат - функціонально змінна частина виразу
	double Pi = 4 * atan(1.0); // число пі

	cout << "x = "; cin >> x;

	double a = ((1 + x) / 9) * (Pi / 180.0); // переведення виразу з градусів у радіани

	A = 1 + x;

	//  спосіб 1: розгалуження в скороченій формі
	if (x <= 4)
		B = (2 + 2 * x) * exp(2 * x);
	if (x > 4 && x <= 7)
		B = 1 / (tan(a)) + 8 * x;
	if (x > 7)
		B = 1 - 7 * x + x * x - 2 * x * x * x;

	y = A + B;

	cout << endl;
	cout << "1) y = " << y << endl;

	// спосіб 2: розгалуження в повній формі
	if (x <= 4)
		B = (2 + 2 * x) * exp(2 * x);
	else
		if (x > 4 && x <= 7)
			B = 1 / (tan(a)) + 8 * x;
		else
			B = 1 - 7 * x + x * x - 2 * x * x * x;

	y = A + B;

	cout << "2) y = " << y << endl;

	cin.get();
	return 0;

}