// Lab_04_2.cpp
// < Величко Іван >
// Лабораторна робота № 4.2
// Табуляція функції, заданої формулою: функція однієї змінної
// Варіант 0.4

#include <iostream>   // для роботи з введенням і виведенням
#include <iomanip>    // для форматування виводу (setprecision, setw)
#include <cmath>      // для математичних функцій (atan, exp, tan)

using namespace std;

int main()
{
    double x, xp, xk, dx, A, B, y;
    double Pi = 4 * atan(1.0); // обчислення значення числа Пі через арктангенс

    // Введення початкового (xp), кінцевого (xk) значень x та кроку dx
    cout << "xp = "; cin >> xp;
    cout << "xk = "; cin >> xk;
    cout << "dx = "; cin >> dx;

    // Форматування виводу для більш зручного перегляду таблиці
    cout << fixed;
    cout << "------------------------" << endl;
    cout << "|" << setw(7) << "x   " << " |"
        << setw(12) << "y     " << " |" << endl;
    cout << "|----------------------|" << endl;

    x = xp;
    while (x <= xk) // Поки x менше або дорівнює кінцевому значенню
    {
        // Переведення виразу ((1 + x) / 9) в радіани
        double a = ((1 + x) / 9) * (Pi / 180.0);

        A = 1 + x;

        // Умови для обчислення значення B залежно від значення x
        if (x <= 4)
            B = (2 + 2 * x) * exp(2 * x); 
        else if (x > 4 && x <= 7)
            B = 1 / tan(a) + 8 * x;
        else
            B = 1 - 7 * x + x * x - 2 * x * x * x;

        y = A + B;

        // Виведення поточного значення x і обчисленого значення y
        cout << "|" << setw(7) << setprecision(2) << x    // Виведення x з двома знаками після коми
            << " |" << setw(12) << setprecision(3) << y  // Виведення y з трьома знаками після коми
            << " |" << endl;

        x += dx; // Збільшення x на крок dx
    }

    // Виведення кінцевого рядка таблиці
    cout << "|----------------------|" << endl;

    return 0;
}