

#include <iostream>   // Для роботи з введенням/виведенням
#include <iomanip>    // Для форматування виводу (setw, setprecision)
#include <cmath>      // Для використання математичних функцій 

using namespace std;

int main()
{
    // Оголошення змінних
    double xp, xk, x, dx, eps, a = 0, R = 0, S = 0;
    int n = 0;

    // Введення початкового та кінцевого значень x, кроку dx, та точності eps
    cout << "xp = "; cin >> xp;  // Вводимо початкове значення x
    cout << "xk = "; cin >> xk;  // Вводимо кінцеве значення x
    cout << "dx = "; cin >> dx;  // Вводимо крок зміни x
    cout << "eps = "; cin >> eps;  // Вводимо точність epsilon (eps)
    cout << fixed;  // Фіксуємо кількість знаків після коми для виведення

    // Виведення заголовку таблиці
    cout << "-------------------------------------------------" << endl;
    cout << "|" << setw(7) << "x" << " |"      // Відведення місця для значення x (5 символів)
        << setw(10) << "e^(x^2)" << " |"      // Місце для функції exp(x) (10 символів)
        << setw(10) << "S" << " |"            // Місце для суми ряду S (7 символів)
        << setw(5) << "n" << " |"            // Місце для кількості ітерацій n (5 символів)
        << endl;
    cout << "-------------------------------------------------" << endl;

    // Цикл по значеннях x від xp до xk з кроком dx
    x = xp;
    while (x <= xk)
    {
        n = 0;    // Ініціалізація лічильника ітерацій
        a = 1;    // Початковий член ряду для обчислення S
        S = a;    // Початкове значення суми ряду

        // Обчислення ряду до досягнення точності eps
        do {
            n++;    // Лічильник членів ряду
            R = x * x / n;  // Співвідношення для наступного члена ряду
            a *= R; // Наступний член ряду
            S += a; // Додавання члена до суми
        } while (abs(a) >= eps);  // Виконуємо, поки абсолютне значення члена ряду більше або дорівнює точності eps

        // Виведення результатів в таблиці
        cout << "|" << setw(7) << setprecision(2) << x << " |"  // Виведення x з точністю до 2 знаків
            << setw(10) << setprecision(5) << exp(x * x) << " |"    // Виведення точного значення exp(x)
            << setw(10) << setprecision(5) << S << " |"         // Виведення наближеного значення S
            << setw(5) << n << " |"                             // Виведення кількості ітерацій
            << endl;

        x += dx;  // Збільшення x на крок dx
    }

    // Виведення завершальної лінії таблиці
    cout << "-------------------------------------------------" << endl;

    return 0;
}