// Lab_04_1.cpp
// < Величко Іван >
// Лабораторна робота № 4.1
// Цикли.
// Варіант 0.4

#include <iostream>  // Для роботи з ввідом-виводом
#include <cmath>     // Для математичних функцій

using namespace std;  // Спрощує використання елементів стандартної бібліотеки

int main()
{
    int N, i;
    double S;

    cout << "N = "; cin >> N;  // Введення значення N з клавіатури

    S = 0;
    i = 1;

    // Цикл while для обчислення суми з умовою (i <= N)
    while (i <= N)
    {
        S += (1 + 1.0 * i / N) / i * i;
        i++;
    }

    cout << S << endl;  // Виведення результату

    S = 0;
    i = 1;

    // Цикл do-while для обчислення суми
    do {
        S += (1 + 1.0 * i / N) / i * i;
        i++;
    } while (i <= N);

    cout << S << endl;

    S = 0;

    // Цикл for для обчислення суми (i від 1 до N)
    for (int i = 1; i <= N; i++)
    {
        S += (1 + 1.0 * i / N) / i * i;
    }

    cout << S << endl;

    S = 0;

    // Зворотний цикл for для обчислення суми (i від N до 1)
    for (i = N; i >= 1; i--)
    {
        S += (1 + 1.0 * i / N) / i * i;
    }

    cout << S << endl;

    return 0;  // Завершення програми

}