// Lab_04_3.cpp
// < Величко Іван >
// Лабораторна робота № 4.3
// Табуляція функції, заданої формулою: функція з параметрами
// Варіант 0.4

#include <iostream>   // для роботи з введенням і виведенням
#include <iomanip>    // для форматування виводу (setw, setprecision)
#include <cmath>      // для використання математичних функцій (якщо знадобляться)

using namespace std;

int main()
{
    // Оголошення змінних
    double x, xp, xk, dx, a, b, c, F;

    // Введення значень змінних a, b, c, а також початкового, кінцевого значення x та кроку dx
    cout << "a = "; cin >> a;
    cout << "b = "; cin >> b;
    cout << "c = "; cin >> c;
    cout << "xp = "; cin >> xp;
    cout << "xk = "; cin >> xk;
    cout << "dx = "; cin >> dx;

    // Фіксований формат виведення, для більш зручного вигляду таблиці
    cout << fixed;
    cout << "------------------------" << endl;
    cout << "|" << setw(7) << "x   " << " |"       // setw(7) - ширина поля для змінної x
        << setw(12) << "F     " << " |" << endl;  // setw(12) - ширина поля для функції F
    cout << "|----------------------|" << endl;

    x = xp;

    while (x <= xk)
    {

        if (c < 0 && x != 0)
            F = -a * x - c;
        else if (c > 0 && x == 0)
            F = (x - a) / -c;
        else
            F = b * x / (c - a);

        // Виведення результату у вигляді таблиці
        cout << "|" << setw(7) << setprecision(2) << x    // Виведення x з точністю до 2 знаків після коми
            << " |" << setw(12) << setprecision(3) << F  // Виведення F з точністю до 3 знаків після коми
            << " |" << endl;

        // Збільшення x на крок dx
        x += dx;
    }

    // Виведення кінцевої лінії таблиці
    cout << "|----------------------|" << endl;

    return 0;
}